# LinePattern Properties

---
The LinePattern type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Name|  Line pattern name.
Top
#### Reference
LinePattern Class
Autodesk.Revit.DB Namespace